; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v12 ?v13)
             (pred_12 ?v4 ?v2)
             (pred_2 ?v12 ?v2)
             (pred_8 ?v11 ?v12 )
	     (pred_9 ?v12)
             (pred_4 ?v7)
             (pred_1 ?v4)
             (pred_10 ?v2)
             (pred_7 ?v12)
             (pred_11 ?v4)
             (pred_5 ?v12)
             (pred_3 ))



(:action op_2
:parameters (?v6 ?v5 ?v10 ?v3)
:precondition (and (pred_4 ?v6) (pred_4 ?v5) (pred_1 ?v10) (pred_10 ?v3)
          (pred_6 ?v6 ?v5) (pred_12 ?v10 ?v3)
                   (pred_2 ?v5 ?v3) (pred_9 ?v6) 
                   (pred_7 ?v5) (pred_11 ?v10))
:effect (and  (pred_5 ?v5) (not (pred_7 ?v5))))


(:action op_5
:parameters (?v6 ?v8)
:precondition (and (pred_4 ?v6) (pred_4 ?v8)
               (pred_9 ?v6) (pred_6 ?v6 ?v8) (pred_5 ?v8))
:effect (and (pred_9 ?v8) (not (pred_9 ?v6))))

(:action op_1
:parameters (?v6 ?v10)
:precondition (and (pred_4 ?v6) (pred_1 ?v10) 
                  (pred_9 ?v6) (pred_8 ?v10 ?v6) (pred_3 ))
:effect (and (pred_11 ?v10)
   (not (pred_8 ?v10 ?v6)) (not (pred_3 ))))


(:action op_4
:parameters (?v6 ?v9 ?v1)
:precondition (and (pred_4 ?v6) (pred_1 ?v9) (pred_1 ?v1)
                  (pred_9 ?v6) (pred_11 ?v1) (pred_8 ?v9 ?v6))
:effect (and (pred_11 ?v9) (pred_8 ?v1 ?v6)
        (not (pred_11 ?v1)) (not (pred_8 ?v9 ?v6))))

(:action op_3
:parameters (?v6 ?v10)
:precondition (and (pred_4 ?v6) (pred_1 ?v10) 
                  (pred_9 ?v6) (pred_11 ?v10))
:effect (and (pred_3 ) (pred_8 ?v10 ?v6) (not (pred_11 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_08 obj_17 obj_14 obj_15 obj_20 obj_18 obj_13 obj_04 obj_11 obj_19 obj_06 obj_03 obj_09 obj_05 obj_02 obj_01
    obj_16 obj_07
    obj_12 obj_10
    )

    (:init
       (pred_3)

       (pred_4 obj_08)
       (pred_4 obj_17)
       (pred_4 obj_14)
       (pred_4 obj_15)
       (pred_4 obj_20)
       (pred_4 obj_18)
       (pred_4 obj_13)
       (pred_4 obj_04)
       (pred_4 obj_11)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_03)
       (pred_4 obj_09)
       (pred_4 obj_05)
       (pred_4 obj_02)
       (pred_4 obj_01)
       (pred_10 obj_16)
       (pred_10 obj_07)
       (pred_1 obj_12)
       (pred_1 obj_10)

       (pred_6 obj_08 obj_20)
       (pred_6 obj_08 obj_17)
       (pred_6 obj_17 obj_18)
       (pred_6 obj_17 obj_14)
       (pred_6 obj_17 obj_08)
       (pred_6 obj_14 obj_13)
       (pred_6 obj_14 obj_15)
       (pred_6 obj_14 obj_17)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_15 obj_14)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_20 obj_18)
       (pred_6 obj_20 obj_08)
       (pred_6 obj_18 obj_19)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_18 obj_17)
       (pred_6 obj_18 obj_20)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_04)
       (pred_6 obj_13 obj_14)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_04 obj_15)
       (pred_6 obj_04 obj_13)
       (pred_6 obj_11 obj_09)
       (pred_6 obj_11 obj_19)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_19 obj_05)
       (pred_6 obj_19 obj_06)
       (pred_6 obj_19 obj_18)
       (pred_6 obj_19 obj_11)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_06 obj_19)
       (pred_6 obj_03 obj_01)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_09 obj_05)
       (pred_6 obj_09 obj_11)
       (pred_6 obj_05 obj_02)
       (pred_6 obj_05 obj_19)
       (pred_6 obj_05 obj_09)
       (pred_6 obj_02 obj_01)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_02 obj_05)
       (pred_6 obj_01 obj_03)
       (pred_6 obj_01 obj_02)
       (pred_7 obj_04)
       (pred_7 obj_17)
       (pred_2  obj_04 obj_16)
       (pred_2  obj_17 obj_07)
       (pred_5 obj_08)
       (pred_5 obj_14)
       (pred_5 obj_15)
       (pred_5 obj_20)
       (pred_5 obj_18)
       (pred_5 obj_13)
       (pred_5 obj_11)
       (pred_5 obj_19)
       (pred_5 obj_06)
       (pred_5 obj_03)
       (pred_5 obj_09)
       (pred_5 obj_05)
       (pred_5 obj_02)
       (pred_5 obj_01)

       (pred_12  obj_12 obj_16)
       (pred_12  obj_10 obj_07)
       (pred_8 obj_12 obj_09)
       (pred_8 obj_10 obj_05)
       (pred_9 obj_01)
    )

    (:goal (and
       (pred_8 obj_10 obj_17)
    ))
(:constraints
  (always (not (pred_9 obj_18)))
)
)

; plan
1. (op_5 obj_01 obj_02)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_02)
   goals met: 0 of 1
2. (op_5 obj_02 obj_05)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_05)
   goals met: 0 of 1
3. (op_1 obj_05 obj_10)
   deleted: (pred_8 obj_10 obj_05) (pred_3)
   added: (pred_11 obj_10)
   goals met: 0 of 1
4. (op_5 obj_05 obj_19)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_19)
   goals met: 0 of 1
5. (op_5 obj_19 obj_11)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_11)
   goals met: 0 of 1
6. (op_5 obj_11 obj_20)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_20)
   goals met: 0 of 1
7. (op_5 obj_20 obj_08)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_08)
   goals met: 0 of 1
8. (op_2 obj_08 obj_17 obj_10 obj_07)
   deleted: (pred_7 obj_17)
   added: (pred_5 obj_17)
   goals met: 0 of 1
9. (op_5 obj_08 obj_17)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_17)
   goals met: 0 of 1
10. (op_3 obj_17 obj_10)
   deleted: (pred_11 obj_10)
   added: (pred_3) (pred_8 obj_10 obj_17)
   goals met: 1 of 1
